In [49]:
import pandas as pd

In [50]:
x = 5
y = 8
xy = "Learning is fun!"

In [51]:
print x
print y 
print xy

5
8
Learning is fun!

In [52]:
print x+y

13

In [53]:
z = u = 4
print z, u

4 4

In [54]:
print 3+8

11

In [55]:
z = 4
z ==4

True

In [56]:
z!=4

False

In [57]:
z>8

False

In [58]:
z<9

True

In [59]:
print round(6.4790)

6.0

In [60]:
print round (6.37103840, 3)

6.371

In [61]:
print isinstance(5, int)
print isinstance(5.0,int)
print isinstance(5.0,(int,float))

True
False
True

In [62]:
print cmp(4,5)
print cmp(5,4)
print cmp(5,5)

-1
1
0

In [63]:
print range(5)
print range(2,16)
print range(3,27,9)

[0, 1, 2, 3, 4]
[2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15]
[3, 12, 21]

In [64]:
print "this is kind of cool

python is exciting"

SyntaxError: EOL while scanning string literal (<ipython-input-64-a208acf1bac7>, line 1)

In [65]:
print """This is cool

Python is really neat"""

This is cool

Python is really neat

In [3]:
string1 = "Market"
print 'Christmas', string1

string2 = '!'
print 'Christmas', string1, string2

Christmas Market
Christmas Market !

In [67]:
print 'Christmas', string1,string2

Christmas Market !

In [1]:
print "Christmas %s" string1

SyntaxError: invalid syntax (<ipython-input-1-d78d60ef314a>, line 1)

In [4]:
print "Christmas %s" % string1

Christmas Market

In [5]:
print "Actual Number = %d" %89
print "Float of the number = %f" %89
print "Octal equivalent of the number = %o" %89
print "Hexadecimal equivalent of the number = %x" %89
print "Explonential equivalent of the number = %e" %89

Actual Number = 89
Float of the number = 89.000000
Octal equivalent of the number = 131
Hexadecimal equivalent of the number = 59
Explonential equivalent of the number = 8.900000e+01

In [6]:
a= []
print type (a)
print isinstance (a, list)

<type 'list'>
True

In [7]:
x=['ballet', 'jazz', 'hip hop']
print x[1]

jazz

In [8]:
print x[0], x[1]

ballet jazz

In [9]:
y = ['folk', 'ballroom', 'tap']
z= [x,y]
print z

[['ballet', 'jazz', 'hip hop'], ['folk', 'ballroom', 'tap']]

In [10]:
z1=z[0]
print z1==x

True

In [11]:
z1[0]

'ballet'

In [12]:
z[0][0]

'ballet'

In [13]:
num= [4,5,6,7,8,9]
print num[0:4]
print num [2:]

[4, 5, 6, 7]
[6, 7, 8, 9]

In [14]:
print num[4:8]

[8, 9]

In [15]:
len(num)

6

In [16]:
[3,4,5] + [6,7,8]

[3, 4, 5, 6, 7, 8]

In [17]:
names = ['ballroom', 'jazz funk', 'folk', 'bellydance']
'jazz funk' in names

True

In [18]:
Tanya in names

NameError: name 'Tanya' is not defined

In [19]:
'Tanya' in names

False

In [20]:
list ('market')

['m', 'a', 'r', 'k', 'e', 't']

In [21]:
lst = (2,2,4,6,8)
lst.append(1)
lst.extend(1st)
print 1st

SyntaxError: invalid syntax (<ipython-input-21-5bd96469cb43>, line 3)

In [22]:
lst.count(1)

NameError: name 'lst' is not defined

In [23]:
lst=(2,2,4,6,8)

In [24]:
lst.count(2)

2

In [25]:
lst.append(2)
lst.extend(2nd)
print 2nd

SyntaxError: invalid syntax (<ipython-input-25-4fbaa2015e7a>, line 2)

In [26]:
lst.append(2)

AttributeError: 'tuple' object has no attribute 'append'

In [27]:
names.sort()
print names
names.sort(reverse=True)
print names

['ballroom', 'bellydance', 'folk', 'jazz funk']
['jazz funk', 'folk', 'bellydance', 'ballroom']

In [28]:
names.sort(key=len)
print names
names.sort(key=len,reverse=True)
print names

['folk', 'ballroom', 'jazz funk', 'bellydance']
['bellydance', 'jazz funk', 'ballroom', 'folk']

In [31]:
lista = [2,4,6,8]
listb = lista
print listb

[2, 4, 6, 8]

In [32]:
lista.pop()
print lista
lista.append(9)
print lista

[2, 4, 6]
[2, 4, 6, 9]

In [39]:
x = 14
if x >10:
    if x ==10:
        print "YES"

In [41]:
x = 14
if x > 10:
    print "yes"
else:
    print "nope"

yes

In [42]:
x = 14
y = 16
if x > y:
    print "x>y"
elif x < y:
    print "x<y"
else: 
    print "x=y"

x<y

In [44]:
import pandas as pd
import datetime

In [49]:
# create a list containing dates from 01-01 to 01-07
dt = datetime.datetime(2018,1,1)
end = datetime.datetime(2018,1,8)
step = datetime.timedelta(days=1)
dates = []

In [52]:
# populate the list 
while dt < end:
    dates.append(dt.strftime('%m-%d'))
    dt += step

In [53]:
dates

['01-01', '01-02', '01-03', '01-04', '01-05', '01-06', '01-07']

In [56]:
d = {'Date': dates, 'Hong Kong': [12, 14, 12, 10, 6, 5, 8], 'Beijing': [-4, 8, 4, 7, 10, 12, 5], 'Dubai': [3, 10, 7, 8, 12, 6, 4]}
d

{'Beijing': [-4, 8, 4, 7, 10, 12, 5],
 'Date': ['01-01', '01-02', '01-03', '01-04', '01-05', '01-06', '01-07'],
 'Dubai': [3, 10, 7, 8, 12, 6, 4],
 'Hong Kong': [12, 14, 12, 10, 6, 5, 8]}

In [57]:
temps = pd.DataFrame(d)
print temps

   Beijing   Date  Dubai  Hong Kong
0       -4  01-01      3         12
1        8  01-02     10         14
2        4  01-03      7         12
3        7  01-04      8         10
4       10  01-05     12          6
5       12  01-06      6          5
6        5  01-07      4          8

In [59]:
ntemps = temps ['Dubai']

In [60]:
print ntemps

0     3
1    10
2     7
3     8
4    12
5     6
6     4
Name: Dubai, dtype: int64

In [61]:
temps = temps.set_index('Date')

In [62]:
temps

       Beijing  Dubai  Hong Kong
Date
01-01       -4      3         12
01-02        8     10         14
01-03        4      7         12
01-04        7      8         10
01-05       10     12          6
01-06       12      6          5
01-07        5      4          8

In [63]:
titanic=pd.read_csv("../data/titanic.csv")
print titanic

     PassengerId  Survived  Pclass  \
0              1         0       3
1              2         1       1
2              3         1       3
3              4         1       1
4              5         0       3
5              6         0       3
6              7         0       1
7              8         0       3
8              9         1       3
9             10         1       2
10            11         1       3
11            12         1       1
12            13         0       3
13            14         0       3
14            15         0       3
15            16         1       2
16            17         0       3
17            18         1       2
18            19         0       3
19            20         1       3
20            21         0       2
21            22         1       2
22            23         1       3
23            24         1       1
24            25         0       3
25            26         1       3
26            27         0       3
27            28         0       1
28            29         1       3
29            30         0       3
..           ...       ...     ...
861          862         0       2
862          863         1       1
863          864         0       3
864          865         0       2
865          866         1       2
866          867         1       2
867          868         0       1
868          869         0       3
869          870         1       3
870          871         0       3
871          872         1       1
872          873         0       1
873          874         0       3
874          875         1       2
875          876         1       3
876          877         0       3
877          878         0       3
878          879         0       3
879          880         1       1
880          881         1       2
881          882         0       3
882          883         0       3
883          884         0       2
884          885         0       3
885          886         0       3
886          887         0       2
887          888         1       1
888          889         0       3
889          890         1       1
890          891         0       3

                                                  Name     Sex   Age  SibSp  \
0                              Braund, Mr. Owen Harris    male  22.0      1
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                               Heikkinen, Miss. Laina  female  26.0      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                             Allen, Mr. William Henry    male  35.0      0
5                                     Moran, Mr. James    male   NaN      0
6                              McCarthy, Mr. Timothy J    male  54.0      0
7                       Palsson, Master. Gosta Leonard    male   2.0      3
8    Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  female  27.0      0
9                  Nasser, Mrs. Nicholas (Adele Achem)  female  14.0      1
10                     Sandstrom, Miss. Marguerite Rut  female   4.0      1
11                            Bonnell, Miss. Elizabeth  female  58.0      0
12                      Saundercock, Mr. William Henry    male  20.0      0
13                         Andersson, Mr. Anders Johan    male  39.0      1
14                Vestrom, Miss. Hulda Amanda Adolfina  female  14.0      0
15                    Hewlett, Mrs. (Mary D Kingcome)   female  55.0      0
16                                Rice, Master. Eugene    male   2.0      4
17                        Williams, Mr. Charles Eugene    male   NaN      0
18   Vander Planke, Mrs. Julius (Emelia Maria Vande...  female  31.0      1
19                             Masselmani, Mrs. Fatima  female   NaN      0
20                                Fynney, Mr. Joseph J    male  35.0      0
21                               Beesley, Mr. Lawrence    male  34.0      0
22                         McGowan, Miss. Anna "Annie"  female  15.0      0
23                        Sloper, Mr. William Thompson    male  28.0      0
24                       Palsson, Miss. Torborg Danira  female   8.0      3
25   Asplund, Mrs. Carl Oscar (Selma Augusta Emilia...  female  38.0      1
26                             Emir, Mr. Farred Chehab    male   NaN      0
27                      Fortune, Mr. Charles Alexander    male  19.0      3
28                       O'Dwyer, Miss. Ellen "Nellie"  female   NaN      0
29                                 Todoroff, Mr. Lalio    male   NaN      0
..                                                 ...     ...   ...    ...
861                        Giles, Mr. Frederick Edward    male  21.0      1
862  Swift, Mrs. Frederick Joel (Margaret Welles Ba...  female  48.0      0
863                  Sage, Miss. Dorothy Edith "Dolly"  female   NaN      8
864                             Gill, Mr. John William    male  24.0      0
865                           Bystrom, Mrs. (Karolina)  female  42.0      0
866                       Duran y More, Miss. Asuncion  female  27.0      1
867               Roebling, Mr. Washington Augustus II    male  31.0      0
868                        van Melkebeke, Mr. Philemon    male   NaN      0
869                    Johnson, Master. Harold Theodor    male   4.0      1
870                                  Balkic, Mr. Cerin    male  26.0      0
871   Beckwith, Mrs. Richard Leonard (Sallie Monypeny)  female  47.0      1
872                           Carlsson, Mr. Frans Olof    male  33.0      0
873                        Vander Cruyssen, Mr. Victor    male  47.0      0
874              Abelson, Mrs. Samuel (Hannah Wizosky)  female  28.0      1
875                   Najib, Miss. Adele Kiamie "Jane"  female  15.0      0
876                      Gustafsson, Mr. Alfred Ossian    male  20.0      0
877                               Petroff, Mr. Nedelio    male  19.0      0
878                                 Laleff, Mr. Kristo    male   NaN      0
879      Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)  female  56.0      0
880       Shelley, Mrs. William (Imanita Parrish Hall)  female  25.0      0
881                                 Markun, Mr. Johann    male  33.0      0
882                       Dahlberg, Miss. Gerda Ulrika  female  22.0      0
883                      Banfield, Mr. Frederick James    male  28.0      0
884                             Sutehall, Mr. Henry Jr    male  25.0      0
885               Rice, Mrs. William (Margaret Norton)  female  39.0      0
886                              Montvila, Rev. Juozas    male  27.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN      1
889                              Behr, Mr. Karl Howell    male  26.0      0
890                                Dooley, Mr. Patrick    male  32.0      0

     Parch            Ticket      Fare        Cabin Embarked
0        0         A/5 21171    7.2500          NaN        S
1        0          PC 17599   71.2833          C85        C
2        0  STON/O2. 3101282    7.9250          NaN        S
3        0            113803   53.1000         C123        S
4        0            373450    8.0500          NaN        S
5        0            330877    8.4583          NaN        Q
6        0             17463   51.8625          E46        S
7        1            349909   21.0750          NaN        S
8        2            347742   11.1333          NaN        S
9        0            237736   30.0708          NaN        C
10       1           PP 9549   16.7000           G6        S
11       0            113783   26.5500         C103        S
12       0         A/5. 2151    8.0500          NaN        S
13       5            347082   31.2750          NaN        S
14       0            350406    7.8542          NaN        S
15       0            248706   16.0000          NaN        S
16       1            382652   29.1250          NaN        Q
17       0            244373   13.0000          NaN        S
18       0            345763   18.0000          NaN        S
19       0              2649    7.2250          NaN        C
20       0            239865   26.0000          NaN        S
21       0            248698   13.0000          D56        S
22       0            330923    8.0292          NaN        Q
23       0            113788   35.5000           A6        S
24       1            349909   21.0750          NaN        S
25       5            347077   31.3875          NaN        S
26       0              2631    7.2250          NaN        C
27       2             19950  263.0000  C23 C25 C27        S
28       0            330959    7.8792          NaN        Q
29       0            349216    7.8958          NaN        S
..     ...               ...       ...          ...      ...
861      0             28134   11.5000          NaN        S
862      0             17466   25.9292          D17        S
863      2          CA. 2343   69.5500          NaN        S
864      0            233866   13.0000          NaN        S
865      0            236852   13.0000          NaN        S
866      0     SC/PARIS 2149   13.8583          NaN        C
867      0          PC 17590   50.4958          A24        S
868      0            345777    9.5000          NaN        S
869      1            347742   11.1333          NaN        S
870      0            349248    7.8958          NaN        S
871      1             11751   52.5542          D35        S
872      0               695    5.0000  B51 B53 B55        S
873      0            345765    9.0000          NaN        S
874      0         P/PP 3381   24.0000          NaN        C
875      0              2667    7.2250          NaN        C
876      0              7534    9.8458          NaN        S
877      0            349212    7.8958          NaN        S
878      0            349217    7.8958          NaN        S
879      1             11767   83.1583          C50        C
880      1            230433   26.0000          NaN        S
881      0            349257    7.8958          NaN        S
882      0              7552   10.5167          NaN        S
883      0  C.A./SOTON 34068   10.5000          NaN        S
884      0   SOTON/OQ 392076    7.0500          NaN        S
885      5            382652   29.1250          NaN        Q
886      0            211536   13.0000          NaN        S
887      0            112053   30.0000          B42        S
888      2        W./C. 6607   23.4500          NaN        S
889      0            111369   30.0000         C148        C
890      0            370376    7.7500          NaN        Q

[891 rows x 12 columns]

In [64]:
print titanic.Cabin.value_counts()

C23 C25 C27        4
G6                 4
B96 B98            4
D                  3
C22 C26            3
E101               3
F2                 3
F33                3
B57 B59 B63 B66    2
C68                2
B58 B60            2
E121               2
D20                2
E8                 2
E44                2
B77                2
C65                2
D26                2
E24                2
E25                2
B20                2
C93                2
D33                2
E67                2
D35                2
D36                2
C52                2
F4                 2
C125               2
C124               2
                  ..
F G63              1
A6                 1
D45                1
D6                 1
D56                1
C101               1
C54                1
D28                1
D37                1
B102               1
D30                1
E17                1
E58                1
F E69              1
D10 D12            1
E50                1
A14                1
C91                1
A16                1
B38                1
B39                1
C95                1
B78                1
B79                1
C99                1
B37                1
A19                1
E12                1
A7                 1
D15                1
Name: Cabin, Length: 147, dtype: int64

In [65]:
medals=pd.read_csv('../data/olympicmedals.csv')
medals.tail()

,City,Edition,Sport,Discipline,Athlete,NOC,Gender,Event,Event_gender,Medal
29211,Beijing,2008,Wrestling,Wrestling Gre-R,"ENGLICH, Mirko",GER,Men,84 - 96kg,M,Silver
29212,Beijing,2008,Wrestling,Wrestling Gre-R,"MIZGAITIS, Mindaugas",LTU,Men,96 - 120kg,M,Bronze
29213,Beijing,2008,Wrestling,Wrestling Gre-R,"PATRIKEEV, Yuri",ARM,Men,96 - 120kg,M,Bronze
29214,Beijing,2008,Wrestling,Wrestling Gre-R,"LOPEZ, Mijain",CUB,Men,96 - 120kg,M,Gold
29215,Beijing,2008,Wrestling,Wrestling Gre-R,"BAROEV, Khasan",RUS,Men,96 - 120kg,M,Silver

In [66]:
medals.Discipline.value_counts()

Athletics          3448
Rowing             2523
Swimming           2439
Artistic G.        2103
Fencing            1547
Football           1387
Hockey             1325
Shooting           1105
Sailing            1061
Basketball          940
Canoe / Kayak F     912
Handball            886
Water polo          880
Volleyball          862
Boxing              842
Cycling Track       692
Wrestling Free.     591
Wrestling Gre-R     549
Weightlifting       548
Judo                435
Diving              356
Baseball            335
Eventing            313
Jumping             312
Archery             305
Cycling Road        303
Tennis              272
Dressage            255
Rugby               192
Softball            180
Modern Pentath.     174
Synchronized S.     153
Table Tennis        120
Badminton           120
Tug of War           94
Rhythmic G.          93
Canoe / Kayak S      90
Taekwondo            80
Polo                 66
Lacrosse             59
Beach volley.        48
Golf                 30
Figure skating       27
Ice Hockey           27
Cricket              24
Mountain Bike        24
Trampoline           18
Triathlon            18
Vaulting             14
Rackets              10
Croquet               8
BMX                   6
Water Motorspor       5
Basque Pelota         4
Roque                 3
Jeu de Paume          3
Name: Discipline, dtype: int64

In [70]:
import pandas as pd
pd.Series
from pandas import Series, DataFrame
import numpy as np
np.random.seed(12345)
import matplotlib.pyplot as plt
plt.rc('figure', figsize=(10,6))
PREVIOUS_MAX_ROWS = pd.options.display.max_rows
pd.options.display.max_rows = 20
np.set_printoptions(precision=4, suppress=True)

In [72]:
obj = pd.Series([5,8,-6,4])
obj

0    5
1    8
2   -6
3    4
dtype: int64

In [73]:
obj.values
obj.index # like range (3)

RangeIndex(start=0, stop=4, step=1)

In [75]:
obj2= pd.Series([5,8,-6,4], index= ['c','a','d','b'])
obj2
obj2.index

Index([u'c', u'a', u'd', u'b'], dtype='object')

In [76]:
obj2['a']
obj2['d']= 7
obj2[['c','a','d']]

c    5
a    8
d    7
dtype: int64

In [77]:
obj2[obj2>0]
obj2 * 2
np.exp(obj2)

c     148.413159
a    2980.957987
d    1096.633158
b      54.598150
dtype: float64

In [78]:
'b' in obj2
'e' in obj2

False

In [79]:
sdata= {'Ohio': 36000, 'Texas': 72000, 'Oregon': 17000, 'Utah':6000}
obj3= pd.Series(sdata)
obj3

Ohio      36000
Oregon    17000
Texas     72000
Utah       6000
dtype: int64

In [80]:
states = ['California', 'Ohio', 'Oregon', 'Utah']
obj4= pd.Series (sdata, index=states)
obj4

California        NaN
Ohio          36000.0
Oregon        17000.0
Utah           6000.0
dtype: float64

In [81]:
pd.isnull(obj4)
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Utah           True
dtype: bool

In [82]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Utah          False
dtype: bool

In [83]:
obj3
obj4
obj3+obj4

California        NaN
Ohio          72000.0
Oregon        34000.0
Texas             NaN
Utah          12000.0
dtype: float64

In [84]:
obj4.name='population'
obj4.index.name='state'
obj4

state
California        NaN
Ohio          36000.0
Oregon        17000.0
Utah           6000.0
Name: population, dtype: float64

In [85]:
obj
obj.index= ['Kathy', 'Daria', 'Jennifer', 'Tanya']
obj

Kathy       5
Daria       8
Jennifer   -6
Tanya       4
dtype: int64

In [98]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
    'year': [2000, 2001, 2002, 2001, 2002, 2003],
    'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame= pd.DataFrame(data)
frame

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002
5  3.2  Nevada  2003

In [99]:
frame.head()

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

In [102]:
pd.DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [106]:
frame2= pd.DataFrame (data,columns= ['year', 'state', 'pop', 'debt'],
                     index= ['one', 'two', 'three', 'four', 
                             'five', 'six'])
frame2
frame2.columns

Index([u'year', u'state', u'pop', u'debt'], dtype='object')

In [107]:
frame2['state']
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [108]:
frame2.loc['four']

year       2001
state    Nevada
pop         2.4
debt        NaN
Name: four, dtype: object

In [111]:
frame2['debt'] = 18.6
frame2
frame2['debt']=np.arange(6.)
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0